src/mathematics/single_variable_calculus/KBrefMeanValueTheoremForIntegrals.org
#+TITLE: mean value theorem for integrals
* Mean value theorem for integrals                                      :def:
  #+begin_quote
  If $f(X)$ is continuous over an interval $\[a, b\]$, then there is at least one point $c \in  [a, b]$ s.t.
  \[\begin{aligned}
  f(c) = \frac{1}{b-a} \int_{a}^{b} f(x)dx
  \end{aligned}\]
  or equivalently,
  \[\begin{aligned}
  \int_{a}^{b} f(x) dx = f(c)(b-a)
  \end{aligned}\]
  for some $c \in [a, b]$

  #+end_quote
** intuition
   The mean of an interval will be less than the minimum and more than the maximum value of $f$ along that interval. If $f$ is continuous along the interval, then by the intermediate value theorem, there must be some point where $f(c)$ equals the mean value.
