docs/mathematics/single_variable_calculus/KBrefMeanValueTheoremForIntegrals.tex
% Created 2021-09-12 Sun 22:50
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{mean value theorem for integrals}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={mean value theorem for integrals},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Mean value theorem for integrals\hfill{}\textsc{def}}
\label{sec:orgb226cba}
\begin{quote}
If \(f(X)\) is continuous over an interval \(\[a, b\]\), then there is at least one point \(c \in  [a, b]\) s.t.
\[\begin{aligned}
  f(c) = \frac{1}{b-a} \int_{a}^{b} f(x)dx
  \end{aligned}\]
or equivalently,
\[\begin{aligned}
  \int_{a}^{b} f(x) dx = f(c)(b-a)
  \end{aligned}\]
for some \(c \in [a, b]\)
\end{quote}
\subsection{intuition}
\label{sec:orga737533}
The mean of an interval will be less than the minimum and more than the maximum value of \(f\) along that interval. If \(f\) is continuous along the interval, then by the intermediate value theorem, there must be some point where \(f(c)\) equals the mean value.
\end{document}
